; domain
(define (domain npuzzle_domain)
  (:requirements :adl)
  (:types tile pos - object)
  (:predicates
    (at ?t - tile ?p - pos)
    (empty ?p - pos)
    (adj ?from - pos ?to - pos))
  (:action slide
    :parameters (?t - tile ?from - pos ?to - pos)
    :precondition (and (at ?t ?from) (empty ?to) (adj ?from ?to))
    :effect (and (not(at ?t ?from)) (at ?t ?to) (empty ?from) (not(empty ?to)) )))

; problem
(define (problem npuzzle-10x10)
  (:domain npuzzle_domain)

  (:objects
    t1 t2 t3 t4 t5 t6 t7 t8 t9 t10 t11 t12 t13 t14 t15 t16 t17 t18 t19 t20 t21 t22 t23 t24 t25 t26 t27 t28 t29 t30 t31 t32 t33 t34 t35 t36 t37 t38 t39 t40 t41 t42 t43 t44 t45 t46 t47 t48 t49 t50 t51 t52 t53 t54 t55 t56 t57 t58 t59 t60 t61 t62 t63 t64 t65 t66 t67 t68 t69 t70 t71 t72 t73 t74 t75 t76 t77 t78 t79 t80 t81 t82 t83 t84 t85 t86 t87 t88 t89 t90 t91 t92 t93 t94 t95 t96 t97 t98 t99 - tile
    p0_0 p0_1 p0_2 p0_3 p0_4 p0_5 p0_6 p0_7 p0_8 p0_9 p1_0 p1_1 p1_2 p1_3 p1_4 p1_5 p1_6 p1_7 p1_8 p1_9 p2_0 p2_1 p2_2 p2_3 p2_4 p2_5 p2_6 p2_7 p2_8 p2_9 p3_0 p3_1 p3_2 p3_3 p3_4 p3_5 p3_6 p3_7 p3_8 p3_9 p4_0 p4_1 p4_2 p4_3 p4_4 p4_5 p4_6 p4_7 p4_8 p4_9 p5_0 p5_1 p5_2 p5_3 p5_4 p5_5 p5_6 p5_7 p5_8 p5_9 p6_0 p6_1 p6_2 p6_3 p6_4 p6_5 p6_6 p6_7 p6_8 p6_9 p7_0 p7_1 p7_2 p7_3 p7_4 p7_5 p7_6 p7_7 p7_8 p7_9 p8_0 p8_1 p8_2 p8_3 p8_4 p8_5 p8_6 p8_7 p8_8 p8_9 p9_0 p9_1 p9_2 p9_3 p9_4 p9_5 p9_6 p9_7 p9_8 p9_9 - pos
  )

  (:init
    (adj p0_0 p1_0) (adj p0_0 p0_1) (adj p0_1 p1_1) (adj p0_1 p0_0) (adj p0_1 p0_2) (adj p0_2 p1_2) (adj p0_2 p0_1) (adj p0_2 p0_3) (adj p0_3 p1_3) (adj p0_3 p0_2) (adj p0_3 p0_4) (adj p0_4 p1_4) (adj p0_4 p0_3) (adj p0_4 p0_5) (adj p0_5 p1_5) (adj p0_5 p0_4) (adj p0_5 p0_6) (adj p0_6 p1_6) (adj p0_6 p0_5) (adj p0_6 p0_7) (adj p0_7 p1_7) (adj p0_7 p0_6) (adj p0_7 p0_8) (adj p0_8 p1_8) (adj p0_8 p0_7) (adj p0_8 p0_9) (adj p0_9 p1_9) (adj p0_9 p0_8) (adj p1_0 p0_0) (adj p1_0 p2_0) (adj p1_0 p1_1) (adj p1_1 p0_1) (adj p1_1 p2_1) (adj p1_1 p1_0) (adj p1_1 p1_2) (adj p1_2 p0_2) (adj p1_2 p2_2) (adj p1_2 p1_1) (adj p1_2 p1_3) (adj p1_3 p0_3) (adj p1_3 p2_3) (adj p1_3 p1_2) (adj p1_3 p1_4) (adj p1_4 p0_4) (adj p1_4 p2_4) (adj p1_4 p1_3) (adj p1_4 p1_5) (adj p1_5 p0_5) (adj p1_5 p2_5) (adj p1_5 p1_4) (adj p1_5 p1_6) (adj p1_6 p0_6) (adj p1_6 p2_6) (adj p1_6 p1_5) (adj p1_6 p1_7) (adj p1_7 p0_7) (adj p1_7 p2_7) (adj p1_7 p1_6) (adj p1_7 p1_8) (adj p1_8 p0_8) (adj p1_8 p2_8) (adj p1_8 p1_7) (adj p1_8 p1_9) (adj p1_9 p0_9) (adj p1_9 p2_9) (adj p1_9 p1_8) (adj p2_0 p1_0) (adj p2_0 p3_0) (adj p2_0 p2_1) (adj p2_1 p1_1) (adj p2_1 p3_1) (adj p2_1 p2_0) (adj p2_1 p2_2) (adj p2_2 p1_2) (adj p2_2 p3_2) (adj p2_2 p2_1) (adj p2_2 p2_3) (adj p2_3 p1_3) (adj p2_3 p3_3) (adj p2_3 p2_2) (adj p2_3 p2_4) (adj p2_4 p1_4) (adj p2_4 p3_4) (adj p2_4 p2_3) (adj p2_4 p2_5) (adj p2_5 p1_5) (adj p2_5 p3_5) (adj p2_5 p2_4) (adj p2_5 p2_6) (adj p2_6 p1_6) (adj p2_6 p3_6) (adj p2_6 p2_5) (adj p2_6 p2_7) (adj p2_7 p1_7) (adj p2_7 p3_7) (adj p2_7 p2_6) (adj p2_7 p2_8) (adj p2_8 p1_8) (adj p2_8 p3_8) (adj p2_8 p2_7) (adj p2_8 p2_9) (adj p2_9 p1_9) (adj p2_9 p3_9) (adj p2_9 p2_8) (adj p3_0 p2_0) (adj p3_0 p4_0) (adj p3_0 p3_1) (adj p3_1 p2_1) (adj p3_1 p4_1) (adj p3_1 p3_0) (adj p3_1 p3_2) (adj p3_2 p2_2) (adj p3_2 p4_2) (adj p3_2 p3_1) (adj p3_2 p3_3) (adj p3_3 p2_3) (adj p3_3 p4_3) (adj p3_3 p3_2) (adj p3_3 p3_4) (adj p3_4 p2_4) (adj p3_4 p4_4) (adj p3_4 p3_3) (adj p3_4 p3_5) (adj p3_5 p2_5) (adj p3_5 p4_5) (adj p3_5 p3_4) (adj p3_5 p3_6) (adj p3_6 p2_6) (adj p3_6 p4_6) (adj p3_6 p3_5) (adj p3_6 p3_7) (adj p3_7 p2_7) (adj p3_7 p4_7) (adj p3_7 p3_6) (adj p3_7 p3_8) (adj p3_8 p2_8) (adj p3_8 p4_8) (adj p3_8 p3_7) (adj p3_8 p3_9) (adj p3_9 p2_9) (adj p3_9 p4_9) (adj p3_9 p3_8) (adj p4_0 p3_0) (adj p4_0 p5_0) (adj p4_0 p4_1) (adj p4_1 p3_1) (adj p4_1 p5_1) (adj p4_1 p4_0) (adj p4_1 p4_2) (adj p4_2 p3_2) (adj p4_2 p5_2) (adj p4_2 p4_1) (adj p4_2 p4_3) (adj p4_3 p3_3) (adj p4_3 p5_3) (adj p4_3 p4_2) (adj p4_3 p4_4) (adj p4_4 p3_4) (adj p4_4 p5_4) (adj p4_4 p4_3) (adj p4_4 p4_5) (adj p4_5 p3_5) (adj p4_5 p5_5) (adj p4_5 p4_4) (adj p4_5 p4_6) (adj p4_6 p3_6) (adj p4_6 p5_6) (adj p4_6 p4_5) (adj p4_6 p4_7) (adj p4_7 p3_7) (adj p4_7 p5_7) (adj p4_7 p4_6) (adj p4_7 p4_8) (adj p4_8 p3_8) (adj p4_8 p5_8) (adj p4_8 p4_7) (adj p4_8 p4_9) (adj p4_9 p3_9) (adj p4_9 p5_9) (adj p4_9 p4_8) (adj p5_0 p4_0) (adj p5_0 p6_0) (adj p5_0 p5_1) (adj p5_1 p4_1) (adj p5_1 p6_1) (adj p5_1 p5_0) (adj p5_1 p5_2) (adj p5_2 p4_2) (adj p5_2 p6_2) (adj p5_2 p5_1) (adj p5_2 p5_3) (adj p5_3 p4_3) (adj p5_3 p6_3) (adj p5_3 p5_2) (adj p5_3 p5_4) (adj p5_4 p4_4) (adj p5_4 p6_4) (adj p5_4 p5_3) (adj p5_4 p5_5) (adj p5_5 p4_5) (adj p5_5 p6_5) (adj p5_5 p5_4) (adj p5_5 p5_6) (adj p5_6 p4_6) (adj p5_6 p6_6) (adj p5_6 p5_5) (adj p5_6 p5_7) (adj p5_7 p4_7) (adj p5_7 p6_7) (adj p5_7 p5_6) (adj p5_7 p5_8) (adj p5_8 p4_8) (adj p5_8 p6_8) (adj p5_8 p5_7) (adj p5_8 p5_9) (adj p5_9 p4_9) (adj p5_9 p6_9) (adj p5_9 p5_8) (adj p6_0 p5_0) (adj p6_0 p7_0) (adj p6_0 p6_1) (adj p6_1 p5_1) (adj p6_1 p7_1) (adj p6_1 p6_0) (adj p6_1 p6_2) (adj p6_2 p5_2) (adj p6_2 p7_2) (adj p6_2 p6_1) (adj p6_2 p6_3) (adj p6_3 p5_3) (adj p6_3 p7_3) (adj p6_3 p6_2) (adj p6_3 p6_4) (adj p6_4 p5_4) (adj p6_4 p7_4) (adj p6_4 p6_3) (adj p6_4 p6_5) (adj p6_5 p5_5) (adj p6_5 p7_5) (adj p6_5 p6_4) (adj p6_5 p6_6) (adj p6_6 p5_6) (adj p6_6 p7_6) (adj p6_6 p6_5) (adj p6_6 p6_7) (adj p6_7 p5_7) (adj p6_7 p7_7) (adj p6_7 p6_6) (adj p6_7 p6_8) (adj p6_8 p5_8) (adj p6_8 p7_8) (adj p6_8 p6_7) (adj p6_8 p6_9) (adj p6_9 p5_9) (adj p6_9 p7_9) (adj p6_9 p6_8) (adj p7_0 p6_0) (adj p7_0 p8_0) (adj p7_0 p7_1) (adj p7_1 p6_1) (adj p7_1 p8_1) (adj p7_1 p7_0) (adj p7_1 p7_2) (adj p7_2 p6_2) (adj p7_2 p8_2) (adj p7_2 p7_1) (adj p7_2 p7_3) (adj p7_3 p6_3) (adj p7_3 p8_3) (adj p7_3 p7_2) (adj p7_3 p7_4) (adj p7_4 p6_4) (adj p7_4 p8_4) (adj p7_4 p7_3) (adj p7_4 p7_5) (adj p7_5 p6_5) (adj p7_5 p8_5) (adj p7_5 p7_4) (adj p7_5 p7_6) (adj p7_6 p6_6) (adj p7_6 p8_6) (adj p7_6 p7_5) (adj p7_6 p7_7) (adj p7_7 p6_7) (adj p7_7 p8_7) (adj p7_7 p7_6) (adj p7_7 p7_8) (adj p7_8 p6_8) (adj p7_8 p8_8) (adj p7_8 p7_7) (adj p7_8 p7_9) (adj p7_9 p6_9) (adj p7_9 p8_9) (adj p7_9 p7_8) (adj p8_0 p7_0) (adj p8_0 p9_0) (adj p8_0 p8_1) (adj p8_1 p7_1) (adj p8_1 p9_1) (adj p8_1 p8_0) (adj p8_1 p8_2) (adj p8_2 p7_2) (adj p8_2 p9_2) (adj p8_2 p8_1) (adj p8_2 p8_3) (adj p8_3 p7_3) (adj p8_3 p9_3) (adj p8_3 p8_2) (adj p8_3 p8_4) (adj p8_4 p7_4) (adj p8_4 p9_4) (adj p8_4 p8_3) (adj p8_4 p8_5) (adj p8_5 p7_5) (adj p8_5 p9_5) (adj p8_5 p8_4) (adj p8_5 p8_6) (adj p8_6 p7_6) (adj p8_6 p9_6) (adj p8_6 p8_5) (adj p8_6 p8_7) (adj p8_7 p7_7) (adj p8_7 p9_7) (adj p8_7 p8_6) (adj p8_7 p8_8) (adj p8_8 p7_8) (adj p8_8 p9_8) (adj p8_8 p8_7) (adj p8_8 p8_9) (adj p8_9 p7_9) (adj p8_9 p9_9) (adj p8_9 p8_8) (adj p9_0 p8_0) (adj p9_0 p9_1) (adj p9_1 p8_1) (adj p9_1 p9_0) (adj p9_1 p9_2) (adj p9_2 p8_2) (adj p9_2 p9_1) (adj p9_2 p9_3) (adj p9_3 p8_3) (adj p9_3 p9_2) (adj p9_3 p9_4) (adj p9_4 p8_4) (adj p9_4 p9_3) (adj p9_4 p9_5) (adj p9_5 p8_5) (adj p9_5 p9_4) (adj p9_5 p9_6) (adj p9_6 p8_6) (adj p9_6 p9_5) (adj p9_6 p9_7) (adj p9_7 p8_7) (adj p9_7 p9_6) (adj p9_7 p9_8) (adj p9_8 p8_8) (adj p9_8 p9_7) (adj p9_8 p9_9) (adj p9_9 p8_9) (adj p9_9 p9_8)
    (at t1 p0_0) (at t2 p0_1) (at t3 p0_2) (at t4 p0_3) (at t5 p0_4) (at t6 p0_5) (at t7 p0_6) (at t8 p0_7) (at t9 p0_8) (at t10 p0_9) (at t11 p1_0) (at t12 p1_1) (at t13 p1_2) (at t14 p1_3) (at t15 p1_4) (at t16 p1_5) (at t17 p1_6) (at t18 p1_7) (at t19 p1_8) (at t20 p1_9) (at t21 p2_0) (at t22 p2_1) (at t23 p2_2) (at t24 p2_3) (at t25 p2_4) (at t26 p2_5) (at t27 p2_6) (at t28 p2_7) (at t29 p2_8) (at t30 p2_9) (at t31 p3_0) (at t32 p3_1) (at t33 p3_2) (at t34 p3_3) (at t35 p3_4) (at t36 p3_5) (at t37 p3_6) (at t38 p3_7) (at t39 p3_8) (at t40 p3_9) (at t41 p4_0) (at t42 p4_1) (at t43 p4_2) (at t44 p4_3) (at t45 p4_4) (at t46 p4_5) (at t47 p4_6) (at t48 p4_7) (at t49 p4_8) (at t50 p4_9) (at t51 p5_0) (at t52 p5_1) (at t53 p5_2) (at t54 p5_3) (at t55 p5_4) (at t56 p5_5) (at t57 p5_6) (at t58 p5_7) (at t59 p5_8) (at t60 p5_9) (at t61 p6_0) (at t62 p6_1) (at t63 p6_2) (at t64 p6_3) (at t65 p6_4) (at t66 p6_5) (at t67 p6_6) (at t68 p6_7) (at t69 p6_8) (at t70 p6_9) (at t71 p7_0) (at t72 p7_1) (at t73 p7_2) (at t74 p7_3) (at t75 p7_4) (at t76 p7_5) (empty p7_6) (at t77 p7_7) (at t79 p7_8) (at t80 p7_9) (at t81 p8_0) (at t82 p8_1) (at t83 p8_2) (at t84 p8_3) (at t85 p8_4) (at t86 p8_5) (at t87 p8_6) (at t78 p8_7) (at t88 p8_8) (at t89 p8_9) (at t91 p9_0) (at t92 p9_1) (at t93 p9_2) (at t94 p9_3) (at t95 p9_4) (at t96 p9_5) (at t97 p9_6) (at t98 p9_7) (at t99 p9_8) (at t90 p9_9)
  )

  (:goal (and
    (at t1 p0_0) (at t2 p0_1) (at t3 p0_2) (at t4 p0_3) (at t5 p0_4) (at t6 p0_5) (at t7 p0_6) (at t8 p0_7) (at t9 p0_8) (at t10 p0_9) (at t11 p1_0) (at t12 p1_1) (at t13 p1_2) (at t14 p1_3) (at t15 p1_4) (at t16 p1_5) (at t17 p1_6) (at t18 p1_7) (at t19 p1_8) (at t20 p1_9) (at t21 p2_0) (at t22 p2_1) (at t23 p2_2) (at t24 p2_3) (at t25 p2_4) (at t26 p2_5) (at t27 p2_6) (at t28 p2_7) (at t29 p2_8) (at t30 p2_9) (at t31 p3_0) (at t32 p3_1) (at t33 p3_2) (at t34 p3_3) (at t35 p3_4) (at t36 p3_5) (at t37 p3_6) (at t38 p3_7) (at t39 p3_8) (at t40 p3_9) (at t41 p4_0) (at t42 p4_1) (at t43 p4_2) (at t44 p4_3) (at t45 p4_4) (at t46 p4_5) (at t47 p4_6) (at t48 p4_7) (at t49 p4_8) (at t50 p4_9) (at t51 p5_0) (at t52 p5_1) (at t53 p5_2) (at t54 p5_3) (at t55 p5_4) (at t56 p5_5) (at t57 p5_6) (at t58 p5_7) (at t59 p5_8) (at t60 p5_9) (at t61 p6_0) (at t62 p6_1) (at t63 p6_2) (at t64 p6_3) (at t65 p6_4) (at t66 p6_5) (at t67 p6_6) (at t68 p6_7) (at t69 p6_8) (at t70 p6_9) (at t71 p7_0) (at t72 p7_1) (at t73 p7_2) (at t74 p7_3) (at t75 p7_4) (at t76 p7_5) (at t77 p7_6) (at t78 p7_7) (at t79 p7_8) (at t80 p7_9) (at t81 p8_0) (at t82 p8_1) (at t83 p8_2) (at t84 p8_3) (at t85 p8_4) (at t86 p8_5) (at t87 p8_6) (at t88 p8_7) (at t89 p8_8) (at t90 p8_9) (at t91 p9_0) (at t92 p9_1) (at t93 p9_2) (at t94 p9_3) (at t95 p9_4) (at t96 p9_5) (at t97 p9_6) (at t98 p9_7) (at t99 p9_8) (empty p9_9)
  ))
)

; plan
1. (slide t77 p7_7 p7_6)
   deleted: (at t77 p7_7) (empty p7_6)
   added: (at t77 p7_6) (empty p7_7)
   goals met: 95 of 100
2. (slide t78 p8_7 p7_7)
   deleted: (at t78 p8_7) (empty p7_7)
   added: (at t78 p7_7) (empty p8_7)
   goals met: 96 of 100
3. (slide t88 p8_8 p8_7)
   deleted: (at t88 p8_8) (empty p8_7)
   added: (at t88 p8_7) (empty p8_8)
   goals met: 97 of 100
4. (slide t89 p8_9 p8_8)
   deleted: (at t89 p8_9) (empty p8_8)
   added: (at t89 p8_8) (empty p8_9)
   goals met: 98 of 100
5. (slide t90 p9_9 p8_9)
   deleted: (at t90 p9_9) (empty p8_9)
   added: (at t90 p8_9) (empty p9_9)
   goals met: 100 of 100
